"""
Основы Python
ДЗ 1 Гладышев ВВ
"""

# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
print("Задание 1")

var_a = 1
var_b = 1.
print("\tvar_a + var_b: ", var_a + var_b)

f_name = input("Введите имя: ")
s_name = input("Введите фамилию: ")
age = input("Введите возраст: ")
print(f"{f_name+' '+s_name}, возраст: {age}\n")

# Пользователь вводит время в секундах.
# Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.
print("Задание 2")

